Get color settings object from the style.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public AnalysisDisplayColorSettings GetColorSettings()
  Visual Basic
Public Function GetColorSettings As AnalysisDisplayColorSettings
  Visual C++
public:
AnalysisDisplayColorSettings^ GetColorSettings()
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace